# -*- coding: utf-8 -*-
# @Time    : 18-3-22下午9:39
# @Author  : 石头人m
# @File    : 【阿里巴巴】m种颜色把圆分n份.py

'''
一个圆分成n个扇形，用m种颜色上色，要求相邻两个颜色不同。求有多少种不同的方法。
'''


def fun(n, m):
    if (n == 1):
        return m
    if (n == 2):
        return m * (m - 1)
    return m * pow(m - 1, n - 1) - fun(n - 1, m)


n, m = map(int, raw_input().split())

print fun(n, m)

'''
递归：
1、第1个扇形和第n-1个扇形颜色不一样，这有s(n-1)种情况，此时插入的扇形n有m-2种颜色选择；
2、第1个扇形和第n-1个扇形颜色一样(n>3)，这有s(n-2)种情况，此时插入的扇形n有m-1种颜色选择。 
s(1) = m;
s(2) = m(m-1);
s(3) = m(m-1)(m-2);
s(n) = s(n-1)*(m-2)+s(n-2)*(m-1);

公式：
f(n,m+1)=(n-2)f(n,m)+(n-1)f（n,m-1),
结合初值f(n,1)=n,f(n,2)=n(n-1),
利用特征根法，即可算出f(n,m)=(n-1)^m+(-1)^m*(n-1)
'''